### 데이터를 불러오기 위해서는 데이터가 저장되어 있는 위치를 알아야 합니다. 
### 제공한 데이터는 aiffel폴더 안에 저장해주시고, path라는 변수에 데이터 경로를 지정해주세요!!

In [1]:
import os
os.getcwd()

'/aiffel/aiffel/data_represent/data'

In [2]:
cd ~/aiffel

/aiffel/aiffel

In [3]:
os.getcwd()

'/aiffel/aiffel'

In [4]:
ls

data_represent/  my_first_directory/  Salaries.csv  workplace/
lost+found/      new_folder/          tutorial/

In [5]:
path = os.getenv("HOME")+"/aiffel/Salaries.csv"

### 데이터를 살펴보기 위해서 우리는 판다스와 넘파이를 불러와야 합니다.
* import를 이용해서 pandas, numpy 패키지를 불러오세요

In [6]:
import numpy as np
import pandas as pd

### Salaries.csv 파일을 data라는 변수명으로 불러와주세요.
* 그냥 불러오면 데이터타입 경고창이 뜰 수 있으니, 해당 경고 메시지를 구글링해서 해결해보시고 왜 이러한 경고 메시지가 뜨는지 조원들과 상의해보세요!!

In [7]:
data = pd.read_csv(path)

/opt/conda/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

### 데이터를 불러오면 가장 먼저 해야할 것은 컬럼을 살펴보고 데이터가 어떤 정보를 가지고 있는지 확인하는 작업입니다.
* 컬럼명을 출력해보세요.

In [9]:
data.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

### 데이터를 살펴보기 위해 상위 5개, 하위 3개 row를 출력해보세요.

In [10]:
data.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [11]:
data.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

### TotalPay column의 합, 평균, 표준편차, 중앙값을 출력해보세요.

In [12]:
data.TotalPay.sum()

11114610134.380001

In [13]:
data.TotalPay.mean()

74768.32197169267

In [14]:
data.TotalPay.std()

50517.00527394987

In [15]:
data.TotalPay.median()

71426.60999999999

### 컬럼별로 null값이 얼마나 있는지 확인해보세요.

In [16]:
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

### 가장 많은 TotalPay를 받는 직원의 위치를 출력해보세요.(출력되는 값은 인덱스)

### OvertimePay 컬럼의 평균을 구해봅시다
`주의`: `TotaltimePay`컬럼과 같은 방법으로 구할 경우 제대로 구해지지 않습니다. 조원들과 문제를 파악해보고 해결해봅시다.

In [20]:
print(data['TotalPay'].max())
data[data['TotalPay']==data['TotalPay'].max()].index

567595.43

Int64Index([0], dtype='int64')

In [46]:
# 코드를 입력하세요.
# 특정값을 교체(replace)해보는 것은 어떨까요?

### 이방법이 간단함 OK

data['OvertimePay'].apply(lambda x: 0 if type(x)==str and x.find('Not')!=-1 else float(x)).mean()

# OvertimePay 컬럼의 평균값이 5066.059886444667 임 ( 원래 있던 답은 5065.92356828608 인데,소수점차이라 부동소수점에의한 차이로 보임 )

5066.059886444667

In [43]:
### 이방법도 되나, 실시간제법소요

for i,ele in enumerate(data['OvertimePay']):
    #if i < 10:
    print("i",i,"ele",ele,type(ele))
    if ele=='Not Provided':
        data['OvertimePay'][i]= np.nan  #print("Not")
    if type(ele)==str and ele!='Not Provided': 
        data['OvertimePay'][i]= float(ele)
print(data['OvertimePay'].mean(skipna=True)       )


#c_data = c_data.apply(float)
#c_data.mean()

'\nfor i,ele in enumerate(data[\'OvertimePay\']):\n    #if i < 10:\n    print("i",i,"ele",ele,type(ele))\n    if ele==\'Not Provided\':\n        data[\'OvertimePay\'][i]= np.nan  #print("Not")\n    if type(ele)==str and ele!=\'Not Provided\': \n        data[\'OvertimePay\'][i]= float(ele)\nprint(data[\'OvertimePay\'].mean(skipna=True)       )\n'

In [49]:
# 팀원 조수익 
pd.to_numeric(data['OvertimePay'], errors='coerce').mean()

5066.059886444667